export default {

  //自动生成文案
  autoMakeHouseDesc() {
    var house_resource_desc = [
      "1.房屋精装修，房子非常干净，室内统一配置品牌家具家电、接入高速wifi，随时可看房，可随时入住;",
      "1.实景拍摄！紧邻地铁！随时看房！现代简约的室内装潢风格，品牌家具家电，给您带来别致的居住享受，真正的宜居简约不简单;",
      "1.此房格局方正，朝向好，阳光非常充足，面积使用率超高，客厅宽敞大气，简约精装修，提包入住;",
      "1.房间装修精美、环境也干净舒适不吵杂，家电家具齐全，随时拎包入住，住的大多数都是年轻人;",
      "1.屋内家电家具配套齐全，朝向好，房子保养的很不错，随时看房，随时可以签约，随时可以入住;",
    ];
    var house_community_desc = [
      "2.位于（变量）区（变量）板块，紧邻核心地段，步行可至地铁占，用“入则宁静,出则繁华”来形容此小区一点也不假;",
      "2.小区环境不错，楼栋采光非常好，前后均无遮挡。周围邻居也很和善，小区有便利店生活也是非常方便的;",
      "2.位于（变量）区（变量）板块，中心地段，高品质小区，居住人群素质高，花园式小区，闹中取静;",
      "2.社区环境好，环境优美，适宜居住，人文素质高，物业管理完善；小区的容积率非常小，属于低密度社区，非常适宜居住;",
      "2.小区绿化高，车停车充足、周边配套设施一应俱全，附近有超市菜场购物方便，让您更加舒适的享受生活;",
      "2.风景宜人，小区安静有保安，安全有保障。小区公共设施齐全，配套完善，为您高品质的生活提供贴心的服务;",
    ];
    var house_surround_desc = [
      "3.小区周边配套设施齐全，地理位置优越，离地铁站、公交站都很近、出行是相当方便、可以省去你很多宝贵时间;",
      "3.交通便利，小区门口有多路公交，步行可到地铁站。抬腿即到公交站，早上可以多睡一会；看房随时联系，随时入住;",
      "3.周边配套设施完善，交通很是便利，骑车几分钟就到地铁口！步行几分钟就到菜市，生活娱乐真是超级方便的;",
      "3.交通便利，地铁公交任您选择；房屋周围设施齐全，菜市场、超市、诊所、各种餐馆、网咖、理发店等等应有尽有，相当便利;",
      "3.周边拥有成熟优越的配套设置，高档小区，优雅的小区环境，优质的物业管理，便捷的交通，让您的出行更加方便、快捷、安全;",
    ];
    let a = this.randomNum(5);
    let b = this.randomNum(6);
    let c = this.randomNum(5);
    console.log(a + "--" + b + "---" + c);
    let args = house_resource_desc[a - 1] + "\n" + house_community_desc[b - 1] + "\n" + house_surround_desc[c - 1];
    return args;
  },
  //生成从1到num的随机数
  randomNum(num) {
    return parseInt(Math.random() * (num) + 1, 10);
  }


}
